// Fill out your copyright notice in the Description page of Project Settings.


#include "WorldManager.h"
#include "../Core/DpGameDelegate.h"


// =============================================================
// 생성자
// =============================================================
FWorldManager::FWorldManager()
{

}

// =============================================================
// 소멸자
// =============================================================
FWorldManager::~FWorldManager()
{

}

// =============================================================
// 초기화
// =============================================================
void FWorldManager::InitSingleton()
{

}

// =============================================================
// 데이터 정리
// =============================================================
void FWorldManager::ClearSingleton()
{
	
}

// =============================================================
// 월드 이동이 완료되었음을 알린다.
// =============================================================
void FWorldManager::OnWorldMoveFinished()
{
	// 일단 월드 id 값이 없어서 아무것도 보내지 않는걸로
	FDpGameDelegate::Get().GetDelegateWorldMoveFinished().Broadcast();
}