// Copyright GuardiansW. All Rights Reserved.


#include "MainUI.h"
#include "../../Manager/UIManager.h"


#include UE_INLINE_GENERATED_CPP_BY_NAME(MainUI)


// =============================================================
// UI를 생성한다.
// =============================================================
UMainUI* UMainUI::CreateUI()
{
	return GetUIManager().CreateUI< UMainUI >( TEXT( "HUD/HUD" ) );
}

// =============================================================
// 생성자
// =============================================================
void UMainUI::OnCreated()
{
	Super::OnCreated();

	_InitControls();
}

// =============================================================
// 소멸자
// =============================================================
void UMainUI::BeginDestroy()
{
	Super::BeginDestroy();
}

// =============================================================
// 화면에 보이는 시점에 호출되는 함수
// =============================================================
void UMainUI::OnAppeared()
{
	Super::OnAppeared();
}

// =============================================================
// 화면에서 사라지는 시점에 호출되는 함수
// =============================================================
void UMainUI::OnDisappeared()
{
	Super::OnDisappeared();
}

// =============================================================
// 위젯을 초기화한다.
// =============================================================
void UMainUI::_InitControls()
{

}