// Copyright Epic Games, Inc. All Rights Reserved.


#include "UIController.h"
#include "../UI/UserWidgetBase.h"


// =============================================================
// 생성자
// =============================================================
FUIController::FUIController()
{

}

// =============================================================
// 소멸자
// =============================================================
FUIController::~FUIController()
{

}

// =============================================================
// 새로운 UI를 Push 한다.
// =============================================================
void FUIController::Push( UUserWidgetBase* InUserWidget )
{

}

// =============================================================
// 최상단 UI를 Pop 한다
// =============================================================
UUserWidgetBase* FUIController::Pop()
{
	return nullptr;
}
